import React from "react";

import './FourSection.scss'
// import request from "superagent";

// import Terapeft from '../../Terapeft/Terapeft'

const FourSection  = props => {
    const state = {
        p: [
            "Довольно часто возникают ситуации, когда нужно быстро получить ответ на вопрос связанный со здоровьем. На часть из этих вопросов можно получить квалифицированный ответ без традиционного приема врача.",
            "Онлайн-консультация врача позволяет быстро получить рекомендацию по вашему случаю и развеять сомнения относительно дальнейших действий по лечению.",
            "Услуга доступна c 8:00 до 20:00.",
            "Консультируйтесь с опытными докторами, а не с медицинскими форумами!"
        ],
        pOnline: [
            "Заменить первый визит к врачу, если нет четкого понимания, какой специалист необходим или случай не покрывает страховка.",
            "Расшифровать результаты анализов или диагностики.",
            "Получить дополнительное мнение доктора на симптомы/анамнез.",
            "Заменить повторный визит к специалисту по результатам анализов для подтверждения или изменения дальнейшего лечения.",
            "Онлайн-консультация не отменяет очный прием у врача, но во многих случаях поможет сэкономить время и деньги."
        ],
        pukr: [
            "Досить часто виникають ситуації, коли потрібно швидко отримати відповідь спеціаліста на запитання, пов'язане зі здоров'ям. На частину таких запитань можна отримати кваліфіковану відповідь без традиційного візиту до лікаря.",
            "Завдяки онлайн-консультації лікаря можна швидко отримати рекомендацію конкретно про ваш випадок і розвіяти сумніви щодо наступних кроків у лікуванні.",
            "Послуга доступна з 8:00 до 20:00.",
            "Краще консультуватися з досвідченими лікарями, а не з інтернет форумами"
        ],
        imgSec: require("../../../img/sec-4-im.png"),
        ul: props.lang === 'ru' ?  [
            "Онлайн-консультация подойдет Вам, если Вам нужен быстрый ответ на вопрос.",
            "Врач свяжется с Вами в течении 30 минут.",
            "Дежурный врач доступен 24/7, каждый день без выходных."
        ] : [
            "Онлайн-консультация подойдет Вам, если Вам нужен быстрый ответ на вопрос.",
            "Врач свяжется с Вами в течении 30 минут.",
            "Дежурный врач доступен 24/7, каждый день без выходных."
        ],
        info:[
            {
                img: "\uD83C\uDFD6\uFE0F",
                text: "Общайтесь с врачами в любое время из любой точки мира"
            },
            {
                img: "\uD83D\uDC68 \uD83D\uDC69",
                text: "Консультации проводят только опытные специалисты"
            },
            {
                img: "\uD83D\uDCDD",
                text: "Сохранение результатов разговора с врачом и полная конфиденциальность"
            },
            {
                img: "\uD83D\uDD25",
                text: "Стоимость телефонной консультации в 3-6 раз дешевле очного приема"
            }
        ],
        infoukr:[
            {
                img: "\uD83C\uDFD6\uFE0F",
                text: "Спілкуйтеся з лікарями з будь-якої точки світу"
            },
            {
                img: "\uD83D\uDC68 \uD83D\uDC69",
                text: "Консультації проводять лише досвідчені спеціалісти\n"
            },
            {
                img: "\uD83D\uDCDD",
                text: "Збереження результатів розмови з лікарем і цілковита конфіденційність"
            },
            {
                img: "\uD83D\uDD25",
                text: "Вартість онлайн-консультації у 3-6 разів дешевша за очну зустріч"
            }
        ]
    }
        return(
            <section className={"FourSection"}>
                <div className="container">
                    <div className="SectionThree_container">
                        <img src={state.imgSec} className={"FourSection_point_img"} alt="section 4 img" />
                        <div className="FourSection_point">
                            <div className="caption small h2">{props.domainName === 'audio.doc.online' ? "В каких случаях можно воспользоваться онлайн-консультацией:"  : props.lang === 'ru' ? "Кому подойдет удаленная консультация врача?" : "У яких випадках вам може знадобитися консультація лікаря віддалено?"}</div>
                            {
                                props.domainName === 'audio.doc.online' ?
                                    state.pOnline.map((p, index) => {
                                        return(
                                            <p key={index}>{p}</p>
                                        )
                                    })
                                    :
                                props.lang === 'ru' ?
                                    state.p.map((p, index) => {
                                        return(
                                            <p key={index}>{p}</p>
                                        )
                                    })
                                    :
                                    state.pukr.map((p, index) => {
                                        return(
                                            <p key={index}>{p}</p>
                                        )
                                    })
                            }
                        </div>
                    </div>
                    <div className="caption h2">{props.lang === 'ru' ? "Преимущества онлайн-консультации" : "Переваги онлайн-консультації"}</div>
                    <div className="FiveSection_info">
                        {
                            props.lang === 'ru' ?
                                state.info.map((info, index) => {
                                    return (
                                        <div className={"FiveSection_info_point"} key={index}>
                                            <div className="FiveSection_info_point_emoji">{info.img}</div>
                                            <div className="FiveSection_info_point_text ">{info.text}</div>
                                        </div>
                                    )
                                })
                                :
                                state.infoukr.map((info, index) => {
                                    return (
                                        <div className={"FiveSection_info_point"} key={index}>
                                            <div className="FiveSection_info_point_emoji">{info.img}</div>
                                            <div className="FiveSection_info_point_text ">{info.text}</div>
                                        </div>
                                    )
                                })
                        }
                    </div>

                </div>
                
            </section>
        )
}

export default FourSection