import React, { Component } from "react";
import mainImage from '../../../img/sec-6-im.png';
import './SixSection.scss'
import Accordion from './Accordion'
import {LazyLoadImage} from "react-lazy-load-image-component";

class SixSection extends Component{
    state = {

        activeAcord: undefined,
        accordion: [
            {
                caption: "Кому подойдет онлайн-консультация врача?",
                text: "Дистанционные консультации предназначены для пациентов, которым необходим совет врача на расстоянии. Сервис не может заменить личный поход к врачу, однако он помогает разобраться с основными вопросами и будет понятнее, как поступать в той или иной ситуации. Например: к какому врачу обратиться или правильно ли назначено лечение. "
            },
            {
                caption: "Получу ли я диагноз после консультации?",
                text: "Дистанционно поставить диагноз врач не имеет права. Он сможет высказать свои рекомендации исходя из предоставленной вами информации, направить на анализы, диагностику или сообщить о необходимости очного визита. Но диагноз редко ставят и в первый визит к врачу. Чаще вам назначают сдачу анализов или дополнительную диагностику. Поэтому в некоторых случаях дистанционная консультация заменяет первое посещение врача."
            },
            {
                caption: "Какие вопросы можно задать специалисту?",
                text: "С врачом можно обсудить любую проблему со здоровьем и получить авторитетное мнение. Кроме этого, можно задать любые вопросы, связанные со здоровьем и медициной. В том числе, вопросы о здоровом питании, занятиях спортом, прививках и так далее."
            },
            {
                caption: "В каких городах работает сервис он-лайн консультаций?",
                text: "Сервис не ограничен географически и доступен в любой точке мира, где есть интернет."
            },
            {
                caption: "Специалисты какого профиля сотрудничают с проектом?",
                text: "В проекте задействованы специалисты разных направлений. Полный список специальностей можно посмотреть в разделе «Доступные врачи для консультаций». Список специальностей постоянно пополняется."
            },
            {
                caption: "Можно ли быть уверенным в конфиденциальности разговора?",
                text: "В плане конфиденциальности, телефонная консультация врача приравнивается к очному приему. В сохранении врачебной тайны можно быть полностью уверенным. К тому же, вы можете не представляться настоящим именем."
            },
            {
                caption: "Стоит ли готовиться к консультации?",
                text: "Специальная подготовка не нужна. Максимум, что вам стоит сделать, это составить список симптомов, которые вас беспокоят и подготовить медицинские документы (результаты анализов, диагностики, назначения другого врача), если они имеют прямое отношение к вопросам консультации. Всю остальную информацию врач у вас узнает в ходе консультации."
            }
        ],
        accordionukr: [
            {
                caption: "У яких випадках онлайн-консультація лікаря стане у нагоді?\n",
                text: "Дистанційні консультації призначені для пацієнтів, яким необхідна порада лікаря на відстані. Сервіс не може замінити особистий візит до лікаря, проте він допомагає розібратися з основними або раптовими запитаннями. Ви отримаєте відповідь фахівця, як вчинити у тій чи іншій ситуації. Наприклад, до якого лікаря краще звернутися або чи правильно вам призначили лікування."
            },
            {
                caption:  "Чи отримаю я діагноз після консультації?",
                text: "Дистанційно поставити діагноз лікар не має права. Він може висловити свої рекомендації, виходячи з наданої вами інформації, направити на аналізи, діагностику або повідомити про необхідність очного візиту. Але діагноз рідко ставлять і під час першого візиту до лікаря. Найчастіше вам призначають здачу аналізів або додаткову діагностику. Тому, у деяких випадках, дистанційна консультація може замінити перший візит до лікаря."
            },
            {
                caption: "Які запитання можна поставити фахівцю?",
                text:  "З лікарем можна обговорити будь-яку проблему зі здоров'ям і отримати кваліфіковану відповідь. Крім того, можна поставити будь-які запитання, пов'язані зі здоров'ям і медициною. Наприклад, запитання щодо здорового харчування, занять спортом, щеплень та інші."
            },
            {
                caption:  "В яких містах працює сервіс онлайн-консультацій?",
                text: "Сервіс онлайн-консультацій доступний у будь-якій точці світу, де є інтернет."
            },
            {
                caption:  "Фахівці якого профілю співпрацюють з проектом?",
                text:  "До проекту залучені фахівці різних напрямків. Повний список спеціальностей можна подивитися в розділі «Доступні лікарі для консультацій». Список спеціальностей постійно поповнюється."
            },
            {
                caption:  "Чи можна бути впевненим в конфіденційності розмови?",
                text:  "Онлайн-консультація лікаря прирівнюється до очного візиту. У збереженні лікарської таємниці можна бути повністю впевненим. До того ж, ви можете не вказувати справжнє ім'я."
            },
            {
                caption:  "Чи варто готуватися до консультації?\n",
                text:  "Спеціальна підготовка не потрібна. Максимум, що вам варто зробити, це скласти список симптомів, які вас турбують, і підготувати медичні документи (результати аналізів, діагностики, призначення іншого лікаря), якщо вони мають пряме відношення до запитань консультації. Всю іншу інформацію лікар у вас дізнається під час консультації."
            }
        ],
        accordionOnline: [
            {
                caption: "Может ли врач поставить диагноз онлайн?",
                text: "Доктор может высказать свои рекомендации по дальнейшим действиям: направить на анализы, диагностику или к узкопрофильному специалисту, дать рекомендации по продолжению или корректировке лечения. Но доктор не может поставить диагноз в режиме онлайн или выписать рецепты на препараты."
            },
            {
                caption:  "Если у меня не долларовая банковская карта, смогу ли я оплатить онлайн-консультацию?",
                text: "Оплатить онлайн-консультацию можно любой банковской картой международных платежных систем. Стоит учесть, что ваш банк может взимать комиссию за платеж и/или конвертацию валют. Подробнее о конвертации валют и комиссии вы можете узнать в вашем банке."
            },
            {
                caption: "Какие вопросы можно задать специалисту?",
                text:  "С врачом можно обсудить любые вопросы и проблемы, связанные со здоровьем."
            },
            {
                caption:  "В каких городах работает сервис онлайн консультаций?",
                text: "Сервис доступен в любой точке мира, где есть интернет. Врачи Doc.online консультируют на русском и украинском языках."
            },
            {
                caption:  "Специалисты какого профиля сотрудничают с проектом?",
                text:  "В проекте задействованы практикующие терапевты и семейные врачи."
            },
            {
                caption:  "Можно ли быть уверенным в конфиденциальности разговора?",
                text:  "Онлайн-консультация в вопросах конфиденциальности приравнивается к очному визиту к врачу. Вы можете быть уверены в сохранности врачебной тайны и вашего диалога со специалистом."
            },
            {
                caption:  "Нужно ли готовиться к консультации?",
                text:  "Специальная подготовка к консультации не нужна. Вы можете составить список симптомов, которые вас беспокоят и подготовить медицинские документы (результаты анализов, диагностики, назначения другого врача), если они имеют прямое отношение к вопросам консультации. Всю остальную информацию врач уточнит у вас в ходе беседы."
            }
        ]
    }
    handleToggle = (index) => {
        this.setState({
            activeAcord: this.state.activeAcord === index ? undefined : index
        })
    }

    render() {

        return (
            <section className={'SixSection mb-0'} id={'questions'}>
                <div className="container">
                    <div className={'caption h2'}>{this.props.lang === 'ru' ? 'Часто задаваемые вопросы': 'Поширені запитання'}</div>
                    <div className="SectionThree_container">
                        <LazyLoadImage
                            alt={"section 6"}
                            className="SixSection_point_img"
                            src={mainImage}/>
                        <div className="SixSection_point">
                            {
                                this.props.domainName === 'audio.doc.online' ?
                                    this.state.accordionOnline.map((acord, index) => {
                                        return(
                                            <Accordion
                                                key={index}
                                                isExpanded={this.state.activeAcord === index}
                                                onToggle={() => this.handleToggle(index)}
                                                captionProp={acord.caption}
                                                textProp={acord.text}
                                            />
                                        )
                                    })
                                    :
                                this.props.lang === 'ru' ?

                                this.state.accordion.map((acord, index) => {

                                    return(
                                        <Accordion
                                            key={index}
                                            isExpanded={this.state.activeAcord === index}
                                            onToggle={() => this.handleToggle(index)}
                                            captionProp={acord.caption}
                                            textProp={acord.text}
                                        />
                                    )
                                })
                                    :
                                    this.state.accordionukr.map((acord, index) => {

                                        return(
                                            <Accordion
                                                key={index}
                                                isExpanded={this.state.activeAcord === index}
                                                onToggle={() => this.handleToggle(index)}
                                                captionProp={acord.caption}
                                                textProp={acord.text}
                                            />
                                        )
                                    })
                            }
                        </div>
                    </div>
                </div>

            </section>
        )
    }
}


export default SixSection